{
  "inflation-reality-journey": {
    "metadata": {
      "title": "The Inflation Reality Journey",
      "description": "A step-by-step exploration of how inflation destroys retirement plans",
      "author": "Retirement Scenario Explorer",
      "estimated_duration": "15 minutes",
      "difficulty": "beginner",
      "tags": ["inflation", "beginner", "guided"],
      "version": "1.0"
    },
    "chapters": [
      {
        "title": "The Fantasy: No Inflation",
        "scenario_key": "inflation-none",
        "narrative": {
          "introduction": "Let's start with a comfortable fantasy - what if inflation simply didn't exist? This scenario uses $500K in savings with $5,200 monthly expenses.",
          "setup": "We'll use a simple scenario: $500,000 in savings, $5,200 monthly expenses, 5% investment returns. In a world without inflation, this looks pretty manageable.",
          "insights": [
            "Your money runs out in year {{duration_years}} - when shortfalls begin",
            "This scenario assumes 0% inflation, which has never happened in modern history",
            "Notice how your expenses stay exactly $5,200 every single month - this never happens in reality",
            "Even this unrealistic best-case scenario shows the challenge of retirement funding"
          ],
          "key_takeaway": "If 0% inflation (impossible) still eventually runs out of money, imagine what reality looks like...",
          "transition": "But what happens when we add just normal, everyday inflation?"
        }
      },
      {
        "title": "The Reality: 3% Inflation",
        "scenario_key": "inflation-3pct", 
        "narrative": {
          "introduction": "Now let's see the EXACT same scenario with realistic 3% annual inflation - the historical average.",
          "setup": "Same $500,000, same starting $5,200 expenses, same 5% returns. The ONLY difference is 3% inflation - what economists consider 'normal'.",
          "insights": [
            "Your money now runs out in just year {{duration_years}} - much sooner!",
            "3% inflation means your expenses double every 23 years",
            "By year 10, you're spending $7,000/month instead of $5,200",
            "By year 20, you're spending $9,400/month - that's 80% more than you started with!",
            "This is why financial advisors call inflation 'the silent killer of retirement'"
          ],
          "key_takeaway": "Just 3% inflation - the 'normal' rate - dramatically shortens your money's lifespan. Now imagine what happened in the 1970s...",
          "transition": "Ready to see what high inflation looks like?"
        }
      },
      {
        "title": "The Nightmare: 1970s Inflation",
        "scenario_key": "inflation-70s",
        "narrative": {
          "introduction": "Welcome to the 1970s, when inflation averaged 8% annually. This actually happened in living memory.",
          "setup": "Same exact portfolio, same starting expenses, but now with 8% inflation. Your grandparents lived through this. It could happen again.",
          "insights": [
            "Your money runs out in just year {{duration_years}} - absolutely devastating",
            "8% inflation means expenses QUADRUPLE in 18 years",
            "Your $5,200 becomes over $20,000 per month by the end",
            "This shows why people who lived through the 70s are terrified of inflation",
            "Even higher investment returns can't save you when inflation eats everything"
          ],
          "key_takeaway": "High inflation periods destroy even well-funded retirement plans. This is why you need inflation protection, not just 'market returns'.",
          "completion_message": "You now understand why inflation is the #1 retirement killer. The scenarios that follow will show you protection strategies like TIPS, real estate, and guaranteed income streams."
        }
      }
    ],
    "story_settings": {
      "auto_advance": false,
      "show_chapter_progress": true,
      "allow_chapter_jumping": true,
      "reset_ui_between_chapters": true
    }
  }
}